Repository: mostafa9999998/motherly_moments
Catalog: lib/l10n/app_*.arb
Languages: ar

# lang
source: /en
ar: /ar

source: Home
ar: الصفحة الرئيسية

source: Insights
ar: أفكار

source: To do list
ar: قائمه المهامات

source: Chating
ar: المحادثات

# setting
source: Settings
ar: الاعدادات

source: Language
ar: اللغة

# theme
source: Themeimg
ar: النمط

# englishh
source: English
ar: العربية

source: English
ar: الأنجليزية

source: Arabic
ar: العربية

source: Light
ar: مضئ

source: Dark
ar: داكن

source: Select
ar: اختر

source: Baby growth
ar: نمو الجنين

source: Body changes
ar: تغيرات الجسم

source: Food
ar: غذاء

# vitamines
source: Vitamins
ar: فيتامينات

source: Exercises
ar: تدريبات

source: Courses
ar: كورسات

# bregnancy
source: Pregnancy
ar: حمل

# birth
source: New born
ar: ولادة

source: Period Tracker
ar: متعقب الدورة الشهرية

# periodQuestion
source: When did your Last period begin?
ar: بدأت دورتك الشهرية الأخيرة؟

# selectperioddate
source: Select the dates of your cycle to log them
ar: حدد تواريخ دورتك لتسجيلها

source: Next
ar: التالى

# babygeowthT
source: Baby’s Monthly Growth
ar: النمو الشهري للطفل

# babygrowthhint
source: Your baby's growth and development during the first year is both delightful (Those coos! Those cuddles!) and dizzying (with all the crying and feeding and diapering, you've got your hands full). Here's your guide to your baby's first year and all its major milestones (first smile, giggle, step, words), challenges (colic and teething and diaper rash, oh my!) and more.'''
ar: '''إن نمو طفلك وتطوره خلال السنة الأولى يكون مبهجًا (تلك الأحاديث! تلك الحضن!) ومثيرًا للدوار (مع كل البكاء والتغذية وتغيير الحفاضات، تكون يديك ممتلئتين). إليك دليلك للسنة الأولى لطفلك وكل معالمها الرئيسية (الابتسامة الأولى، الضحكة، الخطوة، الكلمات)، والتحديات (المغص والتسنين والطفح الجلدي، يا إلهي!) والمزيد.'''

# monthQ1
source: What Happens at Month 1
ar: ماذا يحدث فى الشهر الاول

# monthQ2
source: What Happens at Month 2
ar: ماذا يحدث فى الشهر الثانى

# monthQ3
source: What Happens at Month 3
ar: ماذا يحدث فى الشهر الثالث

# monthQ4
source: What Happens at Month 4
ar: ماذا يحدث فى الشهرالرابع

# monthQ5
source: What Happens at Month 5
ar: ماذا يحدث فى الشهر الخامس

# monthQ6
source: What Happens at Month 6
ar: ماذا يحدث فى الشهر السادس

# monthQ7
source: What Happens at Month 7
ar: ماذا يحدث فى الشهر السابع

# monthQ8
source: What Happens at Month 8
ar: ماذا يحدث فى الشهر الثامن

# monthQ9
source: What Happens at Month 9
ar: ماذا يحدث فى الشهر التاسع

# monthDes1
source: The embryo implants and starts developing.
ar: ينغرس الجنين ويبدأ في التطور

# monthDes2
source: Organs and heartbeat form; limb buds appear
ar: تتكون الأعضاء ويظهر النبض؛ تبدأ الأطراف بالظهور

# monthDes3
source: Organs complete; fetus moves
ar: تكتمل الأعضاء؛ يبدأ الجنين بالحركة

# monthDes4
source: Gender visible; face develops
ar: مكن رؤية الجنس؛ تتطور ملامح الوجه

# monthDes5
source: Movement felt; hair and hearing develop.
ar: تُشعَر الحركة؛ يتطور الشعر والسمع

# monthDes6
source: Skin thins; fingerprints form
ar: تصبح البشرة رقيقة؛ تتشكل بصمات الأصابع

# monthDes7
source: Brain grows; eyes open
ar: ينمو الدماغ؛ تفتح العيون

# monthDes8
source: Brain grows; eyes open
ar: يكتسب الوزن؛ يستعد للولادة

# monthDes9
source: Fully developed; lungs mature ; moves lower
ar: يكتمل النمو؛ تنضج الرئتان؛ يتحرك للأسفل

# bodychangeT
source: Your body's changes: Up to 9 Months
ar: تغيرات جسمك: حتى 9 أشهر

# bodyChangehint
source: '''During pregnancy, common discomforts such as breast tenderness, fatigue, frequent urination, heartburn, nausea, and vomiting often worsen. The body produces extra blood, causing the heart to beat faster and harder to circulate it.'''
ar: ''' قلبك بشكل أسرع وأصعب من المعتاد لحمل الدم 'الزائد .'''

# bodychm1
source: 1 Month : Fertilization & missed period
ar: الشهر الاول :الاخصاب و الدور الشهريه الفائنة

# bodychm2
source: 2 Month : Breast tenderness, low blood pressure
ar: الشهر الثاني: حساسية في الثدي، انخفاض ضغط الدم

# bodychm3
source: 3 Month : Persistent nausea, fatigue
ar: الشهر الثالث :غثيان مستمر، تعب.

# bodychm4
source: 4 Month : Fetal movements, facial changes
ar: الشهر الرابع: حركة الجنين، تغييرات في الوجه.

# bodychm5
source: 5 Month : Increased urination, skin darkening.
ar: الشهر الخامس: زيادة التبول، تغييرات في البشرة.

# bodychm6
source: 6 Month : Back pain, uterus expansion
ar: الشهر السادس: ألم في الظهر، توسع الرحم

# bodychm7
source: 7 Month : Elvic pressure, leg swelling
ar: الشهر السابع: ضغط على الحوض، تورم في الساقين

# bodychm8
source: 8 Month : Sciatic nerve pain, weight gain
ar: لشهر الثامن: ألم في العصب الوركي، زيادة الوزن.

# bodychm9
source: 9 Month : Labor preparation, pelvic changes
ar: الشهر التاسع: استعداد للولادة، تغييرات في الحوض

# bodychdesm1
source: In the first month of pregnancy, expectant mothers often notice early signs such...
ar: في الشهر الأول من الحمل ، غالبا ما تلاحظ الأمهات الحوامل علامات مبكرة مثل ...

# bodychdesm2
source: In the second month of pregnancy, the mother-to-be experiences nausea...
ar: في الشهر الثاني من الحمل ، تعاني الأم من الغثيان ...

# bodychdesm3
source: During this month, many pregnant women feel less physical unease, with...
ar: خلال هذا الشهر ، تشعر العديد من النساء الحوامل بعدم الارتياح الجسدي ، مع ...

# bodychdesm4
source: In the fourth month, miscarriage risk decreases, and pregnancy becomes more..
ar: في الشهر الرابع ، ينخفض خطر الإجهاض ، ويصبح الحمل أكثر..

# bodychdesm5
source: In the fifth month of pregnancy, and as the pregnancy progresses, new symptoms such...
ar: في الشهر الخامس من الحمل ، ومع تقدم الحمل ، تظهر أعراض جديدة مثل ...

# bodychdesm6
source: By the sixth month of pregnancy, most early symptoms have diminished, and...
ar: بحلول الشهر السادس من الحمل ، تضاءلت معظم الأعراض المبكرة ، و ...

# bodychdesm7
source: In the seventh month of pregnancy, mothers may experience leg and...
ar: في الشهر السابع من الحمل ، قد تعاني الأمهات من الساق و ...

# bodychdesm8
source: In the eighth month of pregnancy, the weight of the uterus can cause severe ...
ar: في الشهر الثامن من الحمل ، يمكن أن يسبب وزن الرحم ...

# bodychdesm9
source: In the ninth month of pregnancy, the body prepares for labor, with the baby positioned lower and...
ar: في الشهر التاسع من الحمل ، يستعد الجسم للمخاض ، مع وضع الطفل في وضع منخفض و ...

# coursetitel
source: Courses.
ar: الكورسات.

# corsetopic1
source: Main info
ar: المعلومات الرائسيه

# corsetopic2
source: 10 Mom tips
ar: 10 نصائح للأم

# corsetopic3
source: Advices
ar: نصائح

# corsetopic4
source: Duties
ar: واجبات

# exerisetitel
source: How to make your body healthy while pregnant.
ar: كيف تجعل جسمك صحياًواكثر حيوية أثناء الحمل.

# extopic1
source: Exercise for first Trimester
ar: تمارين لأول ثلاثة أشهر

# extopic2
source: 10 min Exercise
ar: 10 دقائق من التمارين

# extopic3
source: Yoga
ar: يوجا

# extopic4
source: Exercise for second Trimester
ar: تمرين للثلث الثاني من الحمل

# foodtitel
source: How to eat safely while pregnant
ar: كيف تأكل بأمان أثناء الحمل

# foodtopic1
source: Healthy eating in first 3 months
ar: الأكل الصحي في أول 3 أشهر

# foodtopic2
source: Healthy eating in Second 3 months
ar: الأكل الصحي في 3 أشهر الثانية

# foodtopic3
source: Healthy eating in Last 3 months
ar: الأكل الصحي في آخر 3 أشهر

# foodtopicdes1
source: Focusing on folic acid-rich foods for neural development.
ar: لتركيز على الأطعمة الغنية بحمض الفوليك لتطوير الأعصاب

# foodtopicdes2
source: Prioritizing calcium-rich foods for bone growth
ar: إعطاء الأولوية للأطعمة الغنية بالكالسيوم لنمو العظام

# foodtopicdes3
source: Incorporating protein-rich foods for growth and preparation for childbirth
ar: إدراج الأطعمة الغنية بالبروتين لدعم النمو والتحضير للولادة

# vitamintitel
source: Vitamins .
ar: الفيتامينات .

# vitamintopic1
source: omega3
ar: اومجا3

# vitamintopic2
source: zinc
ar: زينك

# vitamintopic3
source: iron
ar: حديد

# vitamintopic4
source: vitamin c
ar: فيتامين ج

source: Female
ar: أنثى

source: Male
ar: ذكر

# babytitel
source: Baby info
ar: أضف معلومات طفلك

# babyQ
source: what's your baby's name?
ar: ما اسم طفلك؟

# babyname
source: please enter the baby name
ar: الرجاء إدخال اسم الطفل

# genderQ
source: Select Your Gender
ar: اختر جنس المولود

# pselectg
source: Please select gender.
ar: الرجاء اختيار جنس المولود

# selectbirth
source: Select your baby's birthday
ar: اختر تاريخ ميلاد طفلك

# seemils
source: See my baby milestones
ar: رؤية معالم طفلي

# babycatgeroytitel
source: “ Wish you have a safe healthy life “
ar: “أتمنى ان تكونى حصلتى على ولادة أمنه“

# childgrowth
source: Child Milestones
ar: نمو الطفل

source: Tips and activities
ar: نصائح وأنشطة

source: Nutrition
ar: التغذية

source: Vaccinations
ar: التطعيمات

source: Common issues
ar: المشاكل الشائعة

# welcomback
source: Welcome Back
ar: مرحباً بك مرة أخرى

# nutritiontitel
source: Take a look on these Nutrition
ar: ألق نظرة على هذه التغذية

source: Weaning
ar: الفطام

source: Breast Feeding
ar: الرضاعه الطبيعيه

source: Bottle Feeding
ar: الرضاعة الصناعية

# weekbottel1
source: 1-6 months
ar: 1-6 أشهر

# weekbottel6
source: 6-12 months
ar: 6-12 أشهر

# weekbottel12
source: 12-18 months
ar: 12-18 أشهر

# weekbottel18
source: 18-24 months
ar: 18-21 أشهر

# tipsmonth1
source: 1-3 months
ar: 1-3 أشهر

# tipsmonth3
source: 3-6 months
ar: 3-6 أشهر

# tipsmonth6
source: 6-9 months
ar: 6-9 أشهر

# tipsmonth9
source: 9-12 months
ar: 9-12 أشهر

# tipsmonth12
source: 12-15 months
ar: 12-15 أشهر

# tipsmonth15
source: 15-18 months
ar: 15-18 أشهر

# tipsmonth18
source: 18-21 months
ar: 18-21 أشهر

# tipsmonth21
source: 21-24 months
ar: 21-24 أشهر

# babyweeksT
source: Your baby is now the size of poppy seed- look at them grow!
ar: أصبح طفلك الآن بحجم الحبة الصغيرة، انظري إليه وهو ينمو!

# babyweeksint
source: We’ll help you track their growth and update you on your baby’s weekly milestones
ar: سنساعدك على تتبع نموه وإطلاعك على مراحل نمو طفلك الأسبوعية

# babybuttonhint
source: See my baby milestones
ar: شاهد معالم طفلي الرضيع

# babyweeh0
source: Your baby at 0 weeks
ar: طفلك في الأسبوع 0 من الحمل

# commonissuehint
source: Take a look on these issues
ar: الق نظرة على هذه المشاكل

source: Log Out
ar: تسجيل الخروج

# birthint
source: New born will remind you of important milestones about your baby
ar: سيذكرك نيو بورن بمعالم مهمة عن طفلك

# birthweek0
source: Your baby is 0 years and 0 months and 0 days old
ar: طفلك يبلغ من العمر 0 سنة و 0 شهر و 0 يوم

# cry
source: cry analyzer
ar: محلل البكاء

# babyweektext1
source: Your baby at
ar: طفلك عند

# weeks
source: week
ar: الاسبوع

source: Your baby is
ar: طفلك يبلغ

source: years and
ar: سنه

source: months and
ar: شهر

source: days old
ar: يوما

# weekbttel1
source: 6-8 months
ar: 6-8 اشهر

# weekbttel6
source: 8-12 months
ar: 8-12 اشهر

# weekbttel12
source: one year
ar: سنة

# weekbttel18
source: Two year
ar: سنتين

# titlepregnancy0
source: “ Wish you have a safe pregnance “
ar: “ نتمنى لك حملا آمنا “
